; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	infrared4 - mode
	image6 - mode
	spectrograph1 - mode
	infrared2 - mode
	image5 - mode
	image0 - mode
	infrared3 - mode
	GroundStation1 - direction
	Star2 - direction
	Star5 - direction
	Star3 - direction
	Star6 - direction
	Star4 - direction
	GroundStation0 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 image5)
	(supports instrument0 infrared4)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
	(supports instrument1 image0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
	(supports instrument2 infrared3)
	(supports instrument2 infrared2)
	(supports instrument2 infrared4)
	(calibration_target instrument2 Star6)
	(supports instrument3 image6)
	(supports instrument3 spectrograph1)
	(supports instrument3 infrared4)
	(calibration_target instrument3 Star4)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet10)
	(supports instrument4 image0)
	(calibration_target instrument4 Star6)
	(supports instrument5 infrared2)
	(supports instrument5 infrared4)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 GroundStation0)
	(calibration_target instrument5 Star4)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star9)
)
(:goal (and
	(have_image Phenomenon7 spectrograph1)
	(have_image Phenomenon7 image0)
	(have_image Star8 infrared3)
	(have_image Star8 image5)
	(have_image Star9 image0)
	(have_image Planet10 infrared3)
	(have_image Planet10 image6)
	(have_image Phenomenon11 image6)
	(have_image Phenomenon11 image0)
	(have_image Phenomenon12 spectrograph1)
	(have_image Phenomenon12 image0)
))

)

; plan
1. (turn_to satellite2 star4 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 star4)
   goals met: 0 of 11
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 11
3. (calibrate satellite2 instrument3 star4)
   added: (calibrated instrument3)
   goals met: 0 of 11
4. (turn_to satellite2 phenomenon11 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 phenomenon11)
   goals met: 0 of 11
5. (turn_to satellite1 star3 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star3)
   goals met: 0 of 11
6. (turn_to satellite0 star4 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star4)
   goals met: 0 of 11
7. (take_image satellite2 phenomenon11 instrument3 image6)
   added: (have_image phenomenon11 image6)
   goals met: 1 of 11
8. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 11
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 11
10. (calibrate satellite1 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 1 of 11
11. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 1 of 11
12. (turn_to satellite0 star8 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star8)
   goals met: 1 of 11
13. (take_image satellite0 star8 instrument0 image5)
   added: (have_image star8 image5)
   goals met: 2 of 11
14. (turn_to satellite1 phenomenon11 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon11)
   goals met: 2 of 11
15. (take_image satellite1 phenomenon11 instrument1 image0)
   added: (have_image phenomenon11 image0)
   goals met: 3 of 11
16. (turn_to satellite1 phenomenon12 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon12)
   goals met: 3 of 11
17. (take_image satellite1 phenomenon12 instrument1 image0)
   added: (have_image phenomenon12 image0)
   goals met: 4 of 11
18. (take_image satellite1 phenomenon12 instrument1 spectrograph1)
   added: (have_image phenomenon12 spectrograph1)
   goals met: 5 of 11
19. (turn_to satellite1 phenomenon7 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon7)
   goals met: 5 of 11
20. (take_image satellite1 phenomenon7 instrument1 image0)
   added: (have_image phenomenon7 image0)
   goals met: 6 of 11
21. (take_image satellite1 phenomenon7 instrument1 spectrograph1)
   added: (have_image phenomenon7 spectrograph1)
   goals met: 7 of 11
22. (turn_to satellite1 star9 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 star9)
   goals met: 7 of 11
23. (take_image satellite1 star9 instrument1 image0)
   added: (have_image star9 image0)
   goals met: 8 of 11
24. (turn_to satellite2 planet10 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 planet10)
   goals met: 8 of 11
25. (take_image satellite2 planet10 instrument3 image6)
   added: (have_image planet10 image6)
   goals met: 9 of 11
26. (switch_off instrument3 satellite2)
   deleted: (power_on instrument3)
   added: (power_avail satellite2)
   goals met: 9 of 11
27. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 9 of 11
28. (turn_to satellite2 star6 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 star6)
   goals met: 9 of 11
29. (calibrate satellite2 instrument2 star6)
   added: (calibrated instrument2)
   goals met: 9 of 11
30. (turn_to satellite2 planet10 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 planet10)
   goals met: 9 of 11
31. (take_image satellite2 planet10 instrument2 infrared3)
   added: (have_image planet10 infrared3)
   goals met: 10 of 11
32. (turn_to satellite2 star8 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 star8)
   goals met: 10 of 11
33. (take_image satellite2 star8 instrument2 infrared3)
   added: (have_image star8 infrared3)
   goals met: 11 of 11
